package programmers.pgmTest2;

public class Main {
    public static void main(String[] args) {
        Solution solution = new Solution();
        int[] a = {6, 2, 3, 4, 1, 5};
        System.out.println(solution.solution(a));;
    }
}
/*
문제 설명
XX 게임은 플레이어가 게임 대기실에 들어온 순서와 플레이어의 등급에 따라 팀을 자동으로 편성해줍니다. 이때, 팀을 편성하는 기준은 다음과 같습니다.

먼저 들어온 플레이어의 팀을 먼저 정합니다.
새로 들어온 플레이어는 새 팀에 배정하거나, 혹은 모든 팀원의 등급이 해당 플레이어의 등급보다 낮은 팀에만 배정할 수 있습니다(숫자가 작을 수록 낮은 등급입니다).
한 번 정해진 팀은 바꿀 수 없습니다.
팀 수는 적을수록 좋습니다.
위의 기준에 맞게 팀을 구성한 경우, 총 몇 팀이 나오는지 구하려 합니다.

대기실 도착 순서에 따른 플레이어의 등급을 담은 배열 stats가 매개변수로 주어질 때, 총 몇 팀이 만들어 지는지 return 하도록 solution 함수를 완성해 주세요.

제한 사항
stats는 플레이어의 등급이 대기실에 입장하는 순서대로 들어있는 배열입니다.
대기실에 입장하는 플레이어 수는 5명 이상 1,000 명 이하입니다.
플레이어의 등급은 1 이상 1,000 이하인 정수입니다.
모든 플레이어의 등급은 서로 다릅니다.
입출력 예시
stats	result
[5, 3, 4, 6, 2, 1]	4
[6, 2, 3, 4, 1, 5]	3
입출력 예시 설명
입출력 예시 #1

처음에 등급 5인 플레이어가 입장해서 팀 하나를 새로 만듭니다. 현재팀 : [5]
다음으로 등급 3인 플레이어가 입장합니다. 등급 5인 플레이어가 속한 팀에는 들어갈 수 없으므로 새로운 팀을 하나 만듭니다. 현재팀 : [5], [3]
다음으로 등급 4인 플레이어가 입장합니다. 새 팀을 생성할 수도 있지만, 팀의 수를 최소로 하기 위해 등급 [3] 인 플레이어가 속한 팀에 배정합니다. 현재팀 : [5], [3, 4]
다음으로 등급 6인 플레이어가 입장합니다. 현재 만들어진 두 팀 중 어느 쪽이든 배정할 수 있습니다. 등급 5인 플레이어가 있는 팀에 배정하도록 하겠습니다. 현재팀 : [5, 6], [3, 4]
다음으로 등급 2인 플레이어가 입장합니다. 현재 만들어진 어느 팀에도 들어갈 수 없기 때문에 새로운 팀을 하나 만듭니다. 현재팀 : [5, 6], [3, 4], [2]
마지막으로 등급 1인 플레이어가 입장합니다. 역시 어느 팀에도 들어갈 수 없기 때문에 새로운 팀 하나를 만듭니다. 현재팀 : [5, 6], [3, 4], [2], [1]
최종 팀 :

팀 1: 등급이 [5, 6]인 플레이어
팀 2: 등급이 [3, 4]인 플레이어
팀 3: 등급이 [2]인 플레이어
팀 4: 등급이 [1]인 플레이어

따라서 최소 4팀을 구성할 수 있습니다.

입출력 예시 #2

팀 1: 등급이 [6]인 플레이어
팀 2: 등급이 [2, 3, 4]인 플레이어
팀 3: 등급이 [1, 5]인 플레이어

로 팀을 구성하면 최소 3팀을 구성할 수 있습니다.
 */